espressif/esp-idf/components/soc/esp32c2/register/soc/extmem_reg.h
/**
 * SPDX-FileCopyrightText: 2021-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** EXTMEM_ICACHE_CTRL_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_ICACHE_CTRL_REG (DR_REG_EXTMEM_BASE + 0x0)
/** EXTMEM_ICACHE_ENABLE : R/W; bitpos: [0]; default: 0;
 *  The bit is used to activate the data cache. 0: disable, 1: enable
 */
#define EXTMEM_ICACHE_ENABLE    (BIT(0))
#define EXTMEM_ICACHE_ENABLE_M  (EXTMEM_ICACHE_ENABLE_V << EXTMEM_ICACHE_ENABLE_S)
#define EXTMEM_ICACHE_ENABLE_V  0x00000001U
#define EXTMEM_ICACHE_ENABLE_S  0

/** EXTMEM_ICACHE_CTRL1_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_ICACHE_CTRL1_REG (DR_REG_EXTMEM_BASE + 0x4)
/** EXTMEM_ICACHE_SHUT_IBUS : R/W; bitpos: [0]; default: 1;
 *  The bit is used to disable core0 ibus, 0: enable, 1: disable
 */
#define EXTMEM_ICACHE_SHUT_IBUS    (BIT(0))
#define EXTMEM_ICACHE_SHUT_IBUS_M  (EXTMEM_ICACHE_SHUT_IBUS_V << EXTMEM_ICACHE_SHUT_IBUS_S)
#define EXTMEM_ICACHE_SHUT_IBUS_V  0x00000001U
#define EXTMEM_ICACHE_SHUT_IBUS_S  0
/** EXTMEM_ICACHE_SHUT_DBUS : R/W; bitpos: [1]; default: 1;
 *  The bit is used to disable core1 ibus, 0: enable, 1: disable
 */
#define EXTMEM_ICACHE_SHUT_DBUS    (BIT(1))
#define EXTMEM_ICACHE_SHUT_DBUS_M  (EXTMEM_ICACHE_SHUT_DBUS_V << EXTMEM_ICACHE_SHUT_DBUS_S)
#define EXTMEM_ICACHE_SHUT_DBUS_V  0x00000001U
#define EXTMEM_ICACHE_SHUT_DBUS_S  1

/** EXTMEM_ICACHE_TAG_POWER_CTRL_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_ICACHE_TAG_POWER_CTRL_REG (DR_REG_EXTMEM_BASE + 0x8)
/** EXTMEM_ICACHE_TAG_MEM_FORCE_ON : R/W; bitpos: [0]; default: 1;
 *  The bit is used to close clock gating of  icache tag memory. 1: close gating, 0:
 *  open clock gating.
 */
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON    (BIT(0))
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON_M  (EXTMEM_ICACHE_TAG_MEM_FORCE_ON_V << EXTMEM_ICACHE_TAG_MEM_FORCE_ON_S)
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON_V  0x00000001U
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON_S  0
/** EXTMEM_ICACHE_TAG_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 *  The bit is used to power  icache tag memory down, 0: follow rtc_lslp, 1: power down
 */
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD    (BIT(1))
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD_M  (EXTMEM_ICACHE_TAG_MEM_FORCE_PD_V << EXTMEM_ICACHE_TAG_MEM_FORCE_PD_S)
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD_V  0x00000001U
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD_S  1
/** EXTMEM_ICACHE_TAG_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 *  The bit is used to power  icache tag memory up, 0: follow rtc_lslp, 1: power up
 */
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU    (BIT(2))
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU_M  (EXTMEM_ICACHE_TAG_MEM_FORCE_PU_V << EXTMEM_ICACHE_TAG_MEM_FORCE_PU_S)
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU_V  0x00000001U
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU_S  2

/** EXTMEM_ICACHE_SYNC_CTRL_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_ICACHE_SYNC_CTRL_REG (DR_REG_EXTMEM_BASE + 0x28)
/** EXTMEM_ICACHE_INVALIDATE_ENA : R/W/SS; bitpos: [0]; default: 1;
 *  The bit is used to enable invalidate operation. It will be cleared by hardware
 *  after invalidate operation done.
 */
#define EXTMEM_ICACHE_INVALIDATE_ENA    (BIT(0))
#define EXTMEM_ICACHE_INVALIDATE_ENA_M  (EXTMEM_ICACHE_INVALIDATE_ENA_V << EXTMEM_ICACHE_INVALIDATE_ENA_S)
#define EXTMEM_ICACHE_INVALIDATE_ENA_V  0x00000001U
#define EXTMEM_ICACHE_INVALIDATE_ENA_S  0
/** EXTMEM_ICACHE_SYNC_DONE : RO; bitpos: [1]; default: 0;
 *  The bit is used to indicate invalidate operation is finished.
 */
#define EXTMEM_ICACHE_SYNC_DONE    (BIT(1))
#define EXTMEM_ICACHE_SYNC_DONE_M  (EXTMEM_ICACHE_SYNC_DONE_V << EXTMEM_ICACHE_SYNC_DONE_S)
#define EXTMEM_ICACHE_SYNC_DONE_V  0x00000001U
#define EXTMEM_ICACHE_SYNC_DONE_S  1

/** EXTMEM_ICACHE_SYNC_ADDR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_ICACHE_SYNC_ADDR_REG (DR_REG_EXTMEM_BASE + 0x2c)
/** EXTMEM_ICACHE_SYNC_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The bits are used to configure the start virtual address for clean operations. It
 *  should be combined with ICACHE_SYNC_SIZE_REG.
 */
#define EXTMEM_ICACHE_SYNC_ADDR    0xFFFFFFFFU
#define EXTMEM_ICACHE_SYNC_ADDR_M  (EXTMEM_ICACHE_SYNC_ADDR_V << EXTMEM_ICACHE_SYNC_ADDR_S)
#define EXTMEM_ICACHE_SYNC_ADDR_V  0xFFFFFFFFU
#define EXTMEM_ICACHE_SYNC_ADDR_S  0

/** EXTMEM_ICACHE_SYNC_SIZE_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_ICACHE_SYNC_SIZE_REG (DR_REG_EXTMEM_BASE + 0x30)
/** EXTMEM_ICACHE_SYNC_SIZE : R/W; bitpos: [22:0]; default: 0;
 *  The bits are used to configure the length for sync operations. The bits are the
 *  counts of cache block. It should be combined with ICACHE_SYNC_ADDR_REG.
 */
#define EXTMEM_ICACHE_SYNC_SIZE    0x007FFFFFU
#define EXTMEM_ICACHE_SYNC_SIZE_M  (EXTMEM_ICACHE_SYNC_SIZE_V << EXTMEM_ICACHE_SYNC_SIZE_S)
#define EXTMEM_ICACHE_SYNC_SIZE_V  0x007FFFFFU
#define EXTMEM_ICACHE_SYNC_SIZE_S  0

/** EXTMEM_IBUS_TO_FLASH_START_VADDR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_REG (DR_REG_EXTMEM_BASE + 0x54)
/** EXTMEM_IBUS_TO_FLASH_START_VADDR : R/W; bitpos: [31:0]; default: 1107296256;
 *  The bits are used to configure the start virtual address of ibus to access flash.
 *  The register is used to give constraints to ibus access counter.
 */
#define EXTMEM_IBUS_TO_FLASH_START_VADDR    0xFFFFFFFFU
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_M  (EXTMEM_IBUS_TO_FLASH_START_VADDR_V << EXTMEM_IBUS_TO_FLASH_START_VADDR_S)
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_V  0xFFFFFFFFU
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_S  0

/** EXTMEM_IBUS_TO_FLASH_END_VADDR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_REG (DR_REG_EXTMEM_BASE + 0x58)
/** EXTMEM_IBUS_TO_FLASH_END_VADDR : R/W; bitpos: [31:0]; default: 1111490559;
 *  The bits are used to configure the end virtual address of ibus to access flash. The
 *  register is used to give constraints to ibus access counter.
 */
#define EXTMEM_IBUS_TO_FLASH_END_VADDR    0xFFFFFFFFU
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_M  (EXTMEM_IBUS_TO_FLASH_END_VADDR_V << EXTMEM_IBUS_TO_FLASH_END_VADDR_S)
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_V  0xFFFFFFFFU
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_S  0

/** EXTMEM_DBUS_TO_FLASH_START_VADDR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_REG (DR_REG_EXTMEM_BASE + 0x5c)
/** EXTMEM_DBUS_TO_FLASH_START_VADDR : R/W; bitpos: [31:0]; default: 1006632960;
 *  The bits are used to configure the start virtual address of dbus to access flash.
 *  The register is used to give constraints to dbus access counter.
 */
#define EXTMEM_DBUS_TO_FLASH_START_VADDR    0xFFFFFFFFU
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_M  (EXTMEM_DBUS_TO_FLASH_START_VADDR_V << EXTMEM_DBUS_TO_FLASH_START_VADDR_S)
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_V  0xFFFFFFFFU
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_S  0

