espressif/esp-idf/components/soc/esp32c2/register/soc/extmem_reg.h
/** EXTMEM_DBUS_TO_FLASH_END_VADDR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_REG (DR_REG_EXTMEM_BASE + 0x60)
/** EXTMEM_DBUS_TO_FLASH_END_VADDR : R/W; bitpos: [31:0]; default: 1010827263;
 *  The bits are used to configure the end virtual address of dbus to access flash. The
 *  register is used to give constraints to dbus access counter.
 */
#define EXTMEM_DBUS_TO_FLASH_END_VADDR    0xFFFFFFFFU
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_M  (EXTMEM_DBUS_TO_FLASH_END_VADDR_V << EXTMEM_DBUS_TO_FLASH_END_VADDR_S)
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_V  0xFFFFFFFFU
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_S  0

/** EXTMEM_CACHE_ACS_CNT_CLR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CACHE_ACS_CNT_CLR_REG (DR_REG_EXTMEM_BASE + 0x64)
/** EXTMEM_IBUS_ACS_CNT_CLR : WOD; bitpos: [0]; default: 0;
 *  The bit is used to clear ibus counter.
 */
#define EXTMEM_IBUS_ACS_CNT_CLR    (BIT(0))
#define EXTMEM_IBUS_ACS_CNT_CLR_M  (EXTMEM_IBUS_ACS_CNT_CLR_V << EXTMEM_IBUS_ACS_CNT_CLR_S)
#define EXTMEM_IBUS_ACS_CNT_CLR_V  0x00000001U
#define EXTMEM_IBUS_ACS_CNT_CLR_S  0
/** EXTMEM_DBUS_ACS_CNT_CLR : WOD; bitpos: [1]; default: 0;
 *  The bit is used to clear dbus counter.
 */
#define EXTMEM_DBUS_ACS_CNT_CLR    (BIT(1))
#define EXTMEM_DBUS_ACS_CNT_CLR_M  (EXTMEM_DBUS_ACS_CNT_CLR_V << EXTMEM_DBUS_ACS_CNT_CLR_S)
#define EXTMEM_DBUS_ACS_CNT_CLR_V  0x00000001U
#define EXTMEM_DBUS_ACS_CNT_CLR_S  1

/** EXTMEM_CACHE_ILG_INT_ENA_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CACHE_ILG_INT_ENA_REG (DR_REG_EXTMEM_BASE + 0x78)
/** EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The bit is used to enable interrupt by sync configurations fault.
 */
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA    (BIT(0))
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_M  (EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_V << EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_S)
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_V  0x00000001U
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_S  0
/** EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable interrupt by preload configurations fault.
 */
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_M  (EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_V << EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_S)
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_V  0x00000001U
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_S  1
/** EXTMEM_MMU_ENTRY_FAULT_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The bit is used to enable interrupt by mmu entry fault.
 */
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA    (BIT(5))
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_M  (EXTMEM_MMU_ENTRY_FAULT_INT_ENA_V << EXTMEM_MMU_ENTRY_FAULT_INT_ENA_S)
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_V  0x00000001U
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_S  5
/** EXTMEM_IBUS_CNT_OVF_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The bit is used to enable interrupt by ibus counter overflow.
 */
#define EXTMEM_IBUS_CNT_OVF_INT_ENA    (BIT(7))
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_M  (EXTMEM_IBUS_CNT_OVF_INT_ENA_V << EXTMEM_IBUS_CNT_OVF_INT_ENA_S)
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_V  0x00000001U
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_S  7
/** EXTMEM_DBUS_CNT_OVF_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The bit is used to enable interrupt by dbus counter overflow.
 */
#define EXTMEM_DBUS_CNT_OVF_INT_ENA    (BIT(8))
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_M  (EXTMEM_DBUS_CNT_OVF_INT_ENA_V << EXTMEM_DBUS_CNT_OVF_INT_ENA_S)
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_V  0x00000001U
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_S  8

/** EXTMEM_CACHE_ILG_INT_CLR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CACHE_ILG_INT_CLR_REG (DR_REG_EXTMEM_BASE + 0x7c)
/** EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR : WOD; bitpos: [0]; default: 0;
 *  The bit is used to clear interrupt by sync configurations fault.
 */
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR    (BIT(0))
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_M  (EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_V << EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_S)
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_V  0x00000001U
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_S  0
/** EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR : WOD; bitpos: [1]; default: 0;
 *  The bit is used to clear interrupt by preload configurations fault.
 */
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_M  (EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_V << EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_S)
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_V  0x00000001U
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_S  1
/** EXTMEM_MMU_ENTRY_FAULT_INT_CLR : WOD; bitpos: [5]; default: 0;
 *  The bit is used to clear interrupt by mmu entry fault.
 */
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR    (BIT(5))
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_M  (EXTMEM_MMU_ENTRY_FAULT_INT_CLR_V << EXTMEM_MMU_ENTRY_FAULT_INT_CLR_S)
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_V  0x00000001U
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_S  5
/** EXTMEM_IBUS_CNT_OVF_INT_CLR : WOD; bitpos: [7]; default: 0;
 *  The bit is used to clear interrupt by ibus counter overflow.
 */
#define EXTMEM_IBUS_CNT_OVF_INT_CLR    (BIT(7))
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_M  (EXTMEM_IBUS_CNT_OVF_INT_CLR_V << EXTMEM_IBUS_CNT_OVF_INT_CLR_S)
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_V  0x00000001U
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_S  7
/** EXTMEM_DBUS_CNT_OVF_INT_CLR : WOD; bitpos: [8]; default: 0;
 *  The bit is used to clear interrupt by dbus counter overflow.
 */
#define EXTMEM_DBUS_CNT_OVF_INT_CLR    (BIT(8))
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_M  (EXTMEM_DBUS_CNT_OVF_INT_CLR_V << EXTMEM_DBUS_CNT_OVF_INT_CLR_S)
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_V  0x00000001U
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_S  8

/** EXTMEM_CACHE_ILG_INT_ST_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CACHE_ILG_INT_ST_REG (DR_REG_EXTMEM_BASE + 0x80)
/** EXTMEM_ICACHE_SYNC_OP_FAULT_ST : RO; bitpos: [0]; default: 0;
 *  The bit is used to indicate interrupt by sync configurations fault.
 */
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST    (BIT(0))
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST_M  (EXTMEM_ICACHE_SYNC_OP_FAULT_ST_V << EXTMEM_ICACHE_SYNC_OP_FAULT_ST_S)
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST_V  0x00000001U
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST_S  0
/** EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST : RO; bitpos: [1]; default: 0;
 *  The bit is used to indicate interrupt by preload configurations fault.
 */
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_M  (EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_V << EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_S)
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_V  0x00000001U
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_S  1
/** EXTMEM_MMU_ENTRY_FAULT_ST : RO; bitpos: [5]; default: 0;
 *  The bit is used to indicate interrupt by mmu entry fault.
 */
#define EXTMEM_MMU_ENTRY_FAULT_ST    (BIT(5))
#define EXTMEM_MMU_ENTRY_FAULT_ST_M  (EXTMEM_MMU_ENTRY_FAULT_ST_V << EXTMEM_MMU_ENTRY_FAULT_ST_S)
#define EXTMEM_MMU_ENTRY_FAULT_ST_V  0x00000001U
#define EXTMEM_MMU_ENTRY_FAULT_ST_S  5
/** EXTMEM_IBUS_ACS_CNT_OVF_ST : RO; bitpos: [7]; default: 0;
 *  The bit is used to indicate interrupt by ibus access flash/spiram counter overflow.
 */
#define EXTMEM_IBUS_ACS_CNT_OVF_ST    (BIT(7))
#define EXTMEM_IBUS_ACS_CNT_OVF_ST_M  (EXTMEM_IBUS_ACS_CNT_OVF_ST_V << EXTMEM_IBUS_ACS_CNT_OVF_ST_S)
#define EXTMEM_IBUS_ACS_CNT_OVF_ST_V  0x00000001U
#define EXTMEM_IBUS_ACS_CNT_OVF_ST_S  7
/** EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST : RO; bitpos: [8]; default: 0;
 *  The bit is used to indicate interrupt by ibus access flash/spiram miss counter
 *  overflow.
 */
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST    (BIT(8))
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_M  (EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_V << EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_S)
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_V  0x00000001U
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_S  8
/** EXTMEM_DBUS_ACS_CNT_OVF_ST : RO; bitpos: [9]; default: 0;
 *  The bit is used to indicate interrupt by dbus access flash/spiram counter overflow.
 */
#define EXTMEM_DBUS_ACS_CNT_OVF_ST    (BIT(9))
#define EXTMEM_DBUS_ACS_CNT_OVF_ST_M  (EXTMEM_DBUS_ACS_CNT_OVF_ST_V << EXTMEM_DBUS_ACS_CNT_OVF_ST_S)
#define EXTMEM_DBUS_ACS_CNT_OVF_ST_V  0x00000001U
#define EXTMEM_DBUS_ACS_CNT_OVF_ST_S  9
/** EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST : RO; bitpos: [10]; default: 0;
 *  The bit is used to indicate interrupt by dbus access flash miss counter overflow.
 */
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST    (BIT(10))
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_M  (EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_V << EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_S)
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_V  0x00000001U
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_S  10

/** EXTMEM_CORE0_ACS_CACHE_INT_ENA_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CORE0_ACS_CACHE_INT_ENA_REG (DR_REG_EXTMEM_BASE + 0x84)
/** EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The bit is used to enable interrupt by cpu access icache while the corresponding
 *  ibus is disabled which include speculative access.
 */
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA    (BIT(0))
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA_M  (EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA_V << EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA_S)
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA_V  0x00000001U
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA_S  0
/** EXTMEM_CORE0_IBUS_WR_IC_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable interrupt by ibus trying to write icache
 */
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA    (BIT(1))
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_M  (EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_V << EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_S)
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_V  0x00000001U
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_S  1
/** EXTMEM_CORE0_IBUS_REJECT_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The bit is used to enable interrupt by authentication fail.
 */
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA    (BIT(2))
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA_M  (EXTMEM_CORE0_IBUS_REJECT_INT_ENA_V << EXTMEM_CORE0_IBUS_REJECT_INT_ENA_S)
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA_V  0x00000001U
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA_S  2
/** EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The bit is used to enable interrupt by cpu access icache while the corresponding
 *  dbus is disabled which include speculative access.
 */
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA    (BIT(3))
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA_M  (EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA_V << EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA_S)
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA_V  0x00000001U
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_ENA_S  3
/** EXTMEM_CORE0_DBUS_REJECT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The bit is used to enable interrupt by authentication fail.
 */
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA    (BIT(4))
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA_M  (EXTMEM_CORE0_DBUS_REJECT_INT_ENA_V << EXTMEM_CORE0_DBUS_REJECT_INT_ENA_S)
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA_V  0x00000001U
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA_S  4
/** EXTMEM_CORE0_DBUS_WR_IC_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The bit is used to enable interrupt by dbus trying to write icache
 */
#define EXTMEM_CORE0_DBUS_WR_IC_INT_ENA    (BIT(5))
#define EXTMEM_CORE0_DBUS_WR_IC_INT_ENA_M  (EXTMEM_CORE0_DBUS_WR_IC_INT_ENA_V << EXTMEM_CORE0_DBUS_WR_IC_INT_ENA_S)
#define EXTMEM_CORE0_DBUS_WR_IC_INT_ENA_V  0x00000001U
#define EXTMEM_CORE0_DBUS_WR_IC_INT_ENA_S  5

/** EXTMEM_CORE0_ACS_CACHE_INT_CLR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CORE0_ACS_CACHE_INT_CLR_REG (DR_REG_EXTMEM_BASE + 0x88)
/** EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR : WOD; bitpos: [0]; default: 0;
 *  The bit is used to clear interrupt by cpu access icache while the corresponding
 *  ibus is disabled or icache is disabled which include speculative access.
 */
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR    (BIT(0))
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR_M  (EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR_V << EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR_S)
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR_V  0x00000001U
#define EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_CLR_S  0
/** EXTMEM_CORE0_IBUS_WR_IC_INT_CLR : WOD; bitpos: [1]; default: 0;
 *  The bit is used to clear interrupt by ibus trying to write icache
 */
#define EXTMEM_CORE0_IBUS_WR_IC_INT_CLR    (BIT(1))
#define EXTMEM_CORE0_IBUS_WR_IC_INT_CLR_M  (EXTMEM_CORE0_IBUS_WR_IC_INT_CLR_V << EXTMEM_CORE0_IBUS_WR_IC_INT_CLR_S)
#define EXTMEM_CORE0_IBUS_WR_IC_INT_CLR_V  0x00000001U
#define EXTMEM_CORE0_IBUS_WR_IC_INT_CLR_S  1
/** EXTMEM_CORE0_IBUS_REJECT_INT_CLR : WOD; bitpos: [2]; default: 0;
 *  The bit is used to clear interrupt by authentication fail.
 */
#define EXTMEM_CORE0_IBUS_REJECT_INT_CLR    (BIT(2))
#define EXTMEM_CORE0_IBUS_REJECT_INT_CLR_M  (EXTMEM_CORE0_IBUS_REJECT_INT_CLR_V << EXTMEM_CORE0_IBUS_REJECT_INT_CLR_S)
#define EXTMEM_CORE0_IBUS_REJECT_INT_CLR_V  0x00000001U
#define EXTMEM_CORE0_IBUS_REJECT_INT_CLR_S  2
/** EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR : WOD; bitpos: [3]; default: 0;
 *  The bit is used to clear interrupt by cpu access icache while the corresponding
 *  dbus is disabled or icache is disabled which include speculative access.
 */
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR    (BIT(3))
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR_M  (EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR_V << EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR_S)
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR_V  0x00000001U
#define EXTMEM_CORE0_DBUS_ACS_MSK_IC_INT_CLR_S  3
/** EXTMEM_CORE0_DBUS_REJECT_INT_CLR : WOD; bitpos: [4]; default: 0;
 *  The bit is used to clear interrupt by authentication fail.
 */
#define EXTMEM_CORE0_DBUS_REJECT_INT_CLR    (BIT(4))
#define EXTMEM_CORE0_DBUS_REJECT_INT_CLR_M  (EXTMEM_CORE0_DBUS_REJECT_INT_CLR_V << EXTMEM_CORE0_DBUS_REJECT_INT_CLR_S)
#define EXTMEM_CORE0_DBUS_REJECT_INT_CLR_V  0x00000001U
#define EXTMEM_CORE0_DBUS_REJECT_INT_CLR_S  4
/** EXTMEM_CORE0_DBUS_WR_IC_INT_CLR : WOD; bitpos: [5]; default: 0;
 *  The bit is used to clear interrupt by dbus trying to write icache
 */
#define EXTMEM_CORE0_DBUS_WR_IC_INT_CLR    (BIT(5))
#define EXTMEM_CORE0_DBUS_WR_IC_INT_CLR_M  (EXTMEM_CORE0_DBUS_WR_IC_INT_CLR_V << EXTMEM_CORE0_DBUS_WR_IC_INT_CLR_S)
#define EXTMEM_CORE0_DBUS_WR_IC_INT_CLR_V  0x00000001U
#define EXTMEM_CORE0_DBUS_WR_IC_INT_CLR_S  5

/** EXTMEM_CORE0_ACS_CACHE_INT_ST_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CORE0_ACS_CACHE_INT_ST_REG (DR_REG_EXTMEM_BASE + 0x8c)
/** EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST : RO; bitpos: [0]; default: 0;
 *  The bit is used to indicate interrupt by cpu access  icache while the core0_ibus is
 *  disabled or icache is disabled which include speculative access.
 */
#define EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST    (BIT(0))
#define EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST_M  (EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST_V << EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST_S)
#define EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST_V  0x00000001U
#define EXTMEM_CORE0_IBUS_ACS_MSK_ICACHE_ST_S  0
/** EXTMEM_CORE0_IBUS_WR_ICACHE_ST : RO; bitpos: [1]; default: 0;
 *  The bit is used to indicate interrupt by ibus trying to write icache
 */
#define EXTMEM_CORE0_IBUS_WR_ICACHE_ST    (BIT(1))
#define EXTMEM_CORE0_IBUS_WR_ICACHE_ST_M  (EXTMEM_CORE0_IBUS_WR_ICACHE_ST_V << EXTMEM_CORE0_IBUS_WR_ICACHE_ST_S)
#define EXTMEM_CORE0_IBUS_WR_ICACHE_ST_V  0x00000001U
#define EXTMEM_CORE0_IBUS_WR_ICACHE_ST_S  1
/** EXTMEM_CORE0_IBUS_REJECT_ST : RO; bitpos: [2]; default: 0;
 *  The bit is used to indicate interrupt by authentication fail.
 */
#define EXTMEM_CORE0_IBUS_REJECT_ST    (BIT(2))
#define EXTMEM_CORE0_IBUS_REJECT_ST_M  (EXTMEM_CORE0_IBUS_REJECT_ST_V << EXTMEM_CORE0_IBUS_REJECT_ST_S)
#define EXTMEM_CORE0_IBUS_REJECT_ST_V  0x00000001U
#define EXTMEM_CORE0_IBUS_REJECT_ST_S  2
/** EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST : RO; bitpos: [3]; default: 0;
 *  The bit is used to indicate interrupt by cpu access icache while the core0_dbus is
 *  disabled or icache is disabled which include speculative access.
 */
#define EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST    (BIT(3))
#define EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST_M  (EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST_V << EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST_S)
#define EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST_V  0x00000001U
#define EXTMEM_CORE0_DBUS_ACS_MSK_ICACHE_ST_S  3
/** EXTMEM_CORE0_DBUS_REJECT_ST : RO; bitpos: [4]; default: 0;
 *  The bit is used to indicate interrupt by authentication fail.
 */
#define EXTMEM_CORE0_DBUS_REJECT_ST    (BIT(4))
#define EXTMEM_CORE0_DBUS_REJECT_ST_M  (EXTMEM_CORE0_DBUS_REJECT_ST_V << EXTMEM_CORE0_DBUS_REJECT_ST_S)
#define EXTMEM_CORE0_DBUS_REJECT_ST_V  0x00000001U
#define EXTMEM_CORE0_DBUS_REJECT_ST_S  4
/** EXTMEM_CORE0_DBUS_WR_ICACHE_ST : RO; bitpos: [5]; default: 0;
 *  The bit is used to indicate interrupt by dbus trying to write icache
 */
#define EXTMEM_CORE0_DBUS_WR_ICACHE_ST    (BIT(5))
#define EXTMEM_CORE0_DBUS_WR_ICACHE_ST_M  (EXTMEM_CORE0_DBUS_WR_ICACHE_ST_V << EXTMEM_CORE0_DBUS_WR_ICACHE_ST_S)
#define EXTMEM_CORE0_DBUS_WR_ICACHE_ST_V  0x00000001U
#define EXTMEM_CORE0_DBUS_WR_ICACHE_ST_S  5

/** EXTMEM_CORE0_DBUS_REJECT_ST_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CORE0_DBUS_REJECT_ST_REG (DR_REG_EXTMEM_BASE + 0x90)
/** EXTMEM_CORE0_DBUS_ATTR : RO; bitpos: [2:0]; default: 0;
 *  The bits are used to indicate the attribute of CPU access dbus when authentication
 *  fail. 0: invalidate, 1: execute-able, 2: read-able, 4: write-able.
 */
#define EXTMEM_CORE0_DBUS_ATTR    0x00000007U
#define EXTMEM_CORE0_DBUS_ATTR_M  (EXTMEM_CORE0_DBUS_ATTR_V << EXTMEM_CORE0_DBUS_ATTR_S)
#define EXTMEM_CORE0_DBUS_ATTR_V  0x00000007U
#define EXTMEM_CORE0_DBUS_ATTR_S  0
/** EXTMEM_CORE0_DBUS_WORLD : RO; bitpos: [3]; default: 0;
 *  The bit is used to indicate the world of CPU access dbus when authentication fail.
 *  0: WORLD0, 1: WORLD1
 */
#define EXTMEM_CORE0_DBUS_WORLD    (BIT(3))
#define EXTMEM_CORE0_DBUS_WORLD_M  (EXTMEM_CORE0_DBUS_WORLD_V << EXTMEM_CORE0_DBUS_WORLD_S)
#define EXTMEM_CORE0_DBUS_WORLD_V  0x00000001U
#define EXTMEM_CORE0_DBUS_WORLD_S  3

/** EXTMEM_CORE0_DBUS_REJECT_VADDR_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CORE0_DBUS_REJECT_VADDR_REG (DR_REG_EXTMEM_BASE + 0x94)
/** EXTMEM_CORE0_DBUS_VADDR : RO; bitpos: [31:0]; default: 4294967295;
 *  The bits are used to indicate the virtual address of CPU access dbus when
 *  authentication fail.
 */
#define EXTMEM_CORE0_DBUS_VADDR    0xFFFFFFFFU
#define EXTMEM_CORE0_DBUS_VADDR_M  (EXTMEM_CORE0_DBUS_VADDR_V << EXTMEM_CORE0_DBUS_VADDR_S)
#define EXTMEM_CORE0_DBUS_VADDR_V  0xFFFFFFFFU
#define EXTMEM_CORE0_DBUS_VADDR_S  0

/** EXTMEM_CORE0_IBUS_REJECT_ST_REG register
 *  This description will be updated in the near future.
 */
#define EXTMEM_CORE0_IBUS_REJECT_ST_REG (DR_REG_EXTMEM_BASE + 0x98)
/** EXTMEM_CORE0_IBUS_ATTR : RO; bitpos: [2:0]; default: 0;
 *  The bits are used to indicate the attribute of CPU access ibus when authentication
 *  fail. 0: invalidate, 1: execute-able, 2: read-able
 */
#define EXTMEM_CORE0_IBUS_ATTR    0x00000007U
#define EXTMEM_CORE0_IBUS_ATTR_M  (EXTMEM_CORE0_IBUS_ATTR_V << EXTMEM_CORE0_IBUS_ATTR_S)
#define EXTMEM_CORE0_IBUS_ATTR_V  0x00000007U
#define EXTMEM_CORE0_IBUS_ATTR_S  0
/** EXTMEM_CORE0_IBUS_WORLD : RO; bitpos: [3]; default: 0;
 *  The bit is used to indicate the world of CPU access ibus when authentication fail.
 *  0: WORLD0, 1: WORLD1
 */
#define EXTMEM_CORE0_IBUS_WORLD    (BIT(3))
#define EXTMEM_CORE0_IBUS_WORLD_M  (EXTMEM_CORE0_IBUS_WORLD_V << EXTMEM_CORE0_IBUS_WORLD_S)
#define EXTMEM_CORE0_IBUS_WORLD_V  0x00000001U
#define EXTMEM_CORE0_IBUS_WORLD_S  3

